// Напишите в ответе на задание этот порядок для каждого выражения и результат всех переменных присвоений.

// 1
var x = 6, y = 15, z = 4;
y /= x + 5 % z;
// 2.142857142857143
// Порядок выполнения %, +, /=

// 2
var x = 6, y = 15, z = 4;
z = x++ + y * 5;
// 81
// Порядок выполнения *, +, =

// 3
var x = 6, y = 15, z = 4; 
x += y - x++ * z;
// -3
// Порядок выполнения *, -, +=

// 4
var x = 6, y = 15, z = 4;
z = -- x - y * 5;
// -70
// Порядок выполнения *, -

// 5
var a = 3;
var b = ++a + 1 + a++;
// 9
// Порядок выполнения ++.., +

